#+title: Tmux
#+setupfile: headers
#+property: header-args:tmux  :mkdirp yes :lexical t :exports code
#+property: header-args:tmux+ :tangle ~/.config/tmux/tmux.conf
#+property: header-args:tmux+ :mkdirp yes :noweb yes

** Plugins!
Using [[https://github.com/tmux-plugins/tpm][TPM]], we can use plugins in Tmux! The way I installed it is very simple:
#+begin_src bash
mkdir -p ~/.config/tmux/
git clone https://github.com/tmux-plugins/tpm.git ~/.config/tmux/tpm
#+end_src

Here’s a list of the plugins that I use.
#+name: plugins
| Plugin                | Why                                                  |
|-----------------------+------------------------------------------------------|
| tpm                   | TPM itself                                           |
| tmux-sensible         | Better defaults I can’t be bothered to change myself |
| tmux-yank             | Better copy/pasting                                  |
| tmux-prefix-highlight | Tell me which prefix I’m using                       |
| tmux-resurrect        | Persist tmux sessions across system restarts         |
| nordtheme/tmux        | Nord theme for Tmux!                                 |

#+begin_src emacs-lisp :var plugins=plugins[,0] :exports code :wrap src tmux
(mapconcat (lambda (plugin)
             (format "set -g @plugin '%s'"
                     (if (string-match-p (quote "/") plugin)
                         plugin
                       (concat "tmux-plugins/" plugin))))
           plugins
           "\n")
#+end_src

#+RESULTS:
#+begin_src tmux
set -g @plugin 'tmux-plugins/tpm'
set -g @plugin 'tmux-plugins/tmux-sensible'
set -g @plugin 'tmux-plugins/tmux-yank'
set -g @plugin 'tmux-plugins/tmux-prefix-highlight'
set -g @plugin 'tmux-plugins/tmux-resurrect'
set -g @plugin 'nordtheme/tmux'
#+end_src

Let’s run TPM right after that.
#+begin_src tmux
run '~/.config/tmux/tpm/tpm'
#+end_src

For restoring processes with =tmux-resurrect=, we must add additional
programs in the =@resurrect-processes= variable. These are:
#+name: resurrect-processes-list
- ="~ncmpcpp -q"=
- =btop=
- =ssh=

#+name: resurrect-processes
#+begin_src emacs-lisp :var processes=resurrect-processes-list :exports none :cache yes
(mapconcat (lambda (process) (string-replace "=" "" process))
           processes
           " ")
#+end_src

#+RESULTS[4f72312f2da98c81eff2b092779a59c993fa19e2]: resurrect-processes
: "~ncmpcpp -q" btop ssh

#+begin_src tmux :noweb yes
set -g @resurrect-processes '<<resurrect-processes()>>'
#+end_src

** Keybindings
Firstly, I don’t like prefixing all of my keybindings with ~C-b~, that’s
what I use in ~insert-mode~ in Emacs to make the cursor go back. So
instead, let’s set meta with space as my prefix.
#+begin_src tmux
unbind C-b
set -g prefix M-Space
bind M-Space send-prefix
#+end_src

Now, I will only add few keybindings on the root prefix that actually
do something immediately, I will mostly add keybindings that will lead
to other prefixes; I prefer by far to have keychords that are a bit
lengthy and mnemonic than some obscure “ ~C-M-&~ is for doing this and
that”.

#+name: std-prefix
| Keybinding | Command          | Prefix to go to |
|------------+------------------+-----------------|
| =«=          | select-window -p |                 |
| =»=          | select-window -n |                 |
| =Tab=        |                  | windows         |
| =w=          |                  | pane            |
| =y=          |                  | copy-mode       |

Note I am using the key =w= to access the pane prefix because of how
used to Emacs I am, and in Emacs terminology panes are windows while
tmux windows would be tabs.

#+name: gen-keybinds
#+begin_src emacs-lisp :var keybinds=std-prefix :var prefix="prefix" :exports none
(mapconcat (lambda (keybind)
             (format "bind-key -T %s %s %s"
                     prefix
                     (string-replace "=" "" (car keybind))
                     (let* ((command (nth 1 keybind))
                            (command (if (string= "" command) nil command))
                            (goto-prefix (nth 2 keybind))
                            (goto-prefix (if (or (null goto-prefix)
                                                 (string= "" goto-prefix))
                                             nil
                                           (concat "switch-client -T " goto-prefix))))
                       (if (and command goto-prefix)
                           (concat command "\\; " goto-prefix)
                         (or command goto-prefix)))))
           keybinds
           "\n")
#+end_src

#+RESULTS[3e58a076aacba87d1cca87db849460e4c2414e94]: gen-keybinds
: bind-key -T prefix « select-window -p
: bind-key -T prefix » select-window -n
: bind-key -T prefix Tab switch-client -T windows
: bind-key -T prefix w switch-client -T pane
: bind-key -T prefix y switch-client -T copy-mode

#+begin_src tmux
<<gen-keybinds()>>
#+end_src

